
TODO config

- but the beginning
- user login using console, telnet or ssh

** daemon or something like that

- agetty
- sshd - sshd - sshd - bash - sudo - bash - pstree

** /etc

- profile : first call by bash
- profile.d
- bashrc
- bash_completion.d
- skel/
  - .bashrc
  - .bash_profile
  - .bash_logout

** ~/

  - .bashrc
  - .bash_profile : then the next after /etc/profile
  - .bash_logout
  - .bash_history
  - .bash_login : /etc/profile -> .bash_profile -> .bash_login -> .profile
  - .profile : /etc/profile -> .bash_profile -> .bash_login -> .profile

** dig

- --noprofile

** rcfile, rc, bashrc

* rhce > ex300, 20180414

- Python then Perl
- Perl then Python
- nil or more then help

* pre

- yum install bash-completion -y

* book, learning bash on my desk
* config > .bash_profile
* bash script vs sh, so
* bash on windows?

- cygwin을 대체하여 개인적으로 사용할 수는 있을까? 
- windows 2003에는 무리겠지? windows 2003은 어떠나? 이제 신경쓰지 않아도 될까?

| cmd                 | so    |
|---------------------+-------|
| ls /mnt             | c d t |
| apt install sysstat |       |
| ifconfig            |       |
| netstat -rn         |       |
| nmap                |       |
| iptraf              |       |
| nload               |       |

* so what?
* TODO BASH_REMATCH, match, re

- support since version 3 of bash (released in 2004)
  - https://tldp.org/LDP/abs/html/bashver3.html
    - On July 27, 2004, Chet Ramey released version 3 of Bash.
    - A new, more generalized {a..z} brace expansion operator.
    - The =~ Regular Expression matching operator within a double brackets test expression.
      - Using the [[ ... ]] test construct, rather than [ ... ] can prevent many logic errors in scripts.
        - There exists a dedicated command called [ (left bracket special character). 
          -  It is a synonym for test, and a builtin for efficiency reasons.
        - With version 2.02, Bash introduced the [[ ... ]] extended test command,
          - Note that [[ is a keyword, not a command.
            - As examples, for, while, do, and ! are keywords. 
            - but a subunit of a command construct. 
            - The type command can be useful for testing whether a certain command exists.
      - The (( )) construct expands and evaluates an arithmetic expression. 
        - The let command carries out arithmetic operations on variables.
          - expr : All-purpose expression evaluator

#+BEGIN_SRC shell
  #host='GA2100SU-1A'
  host='GA2100SU-3A'

  if [[ $host =~ ^([a-z0-9]+)-([a-z0-9]+) ]]
  then
          echo ${BASH_REMATCH[0]} = ${BASH_REMATCH[1]} - ${BASH_REMATCH[2]}
  fi
#+END_SRC

#+RESULTS:
: GA2100SU-3A = GA2100SU - 3A

* TODO case

#+BEGIN_SRC shell
  CHK=cc

  case $CHK in
      "aa") echo 'chk aa' ;;
      "bb") echo 'chk bb' ;;
      *) echo 'others' ;;
  esac
#+END_SRC
